# ----------------------------
# ----- 4.3 単純な線グラフ -----
# ----------------------------
import matplotlib.pyplot as plt
plt.style.use('seaborn-whitegrid')
import numpy as np

# すべてのプロットに対して，図(figure)と座標軸(axes)の作成を最初に行う．
fig = plt.figure()
ax = plt.axes()

# axesを作成したら，ax.plot関数を使用してデータをプロットすることができる．
x = np.linspace(0, 10, 1000)
ax.plot(x, np.sin(x))
# plt.plot(x, np.sin(x))

# 1つのFigureに複数の線を描きたい場合には，単にplot関数を複数回呼び出す．
plt.plot(x, np.sin(x))
plt.plot(x, np.cos(x))



# ---------------------------------------------
# ----- 4.3.1 プロットの制御：線の色とスタイル -----
# ---------------------------------------------



# -----------------------------------------
# ----- 4.3.2 プロットの制御：座標軸の範囲 -----
# -----------------------------------------



# ------------------------------------
# ----- 4.3.3 プロットへのラベル付け -----
# ------------------------------------
plt.show()